PRACTICA 35

In [3]:
import numpy as np
import pandas as pd

# Ventas en mil millones de dólares de las diferentes compañias fabricantes de Hardware entre los años 2016 - 2019

my_data = {
    'Año': [2016, 2017, 2018, 2019],
    'AMD': [4.27, 5.33, 6.48, 6.73],
    'Intel': [59.39, 62.76, 70.85, 71.97],
    'Samsung': [175, 215, 218, 197],
    'Seagate': [11.16, 10.77, 11.20, 10.51]
}

my_dataFrame = pd.DataFrame(my_data)

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"], index=[0, 1, 2, 3, 4, 5])

populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

frame3 = pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [5]:
import pandas as pd

# dataCuba es un diccionario donde la 'clave' de cada elemento es un 'string' y el valor es una 'lista' 
# Note como coloca todos los pares 'clave'-'valor' por columnas cuando se convierte en el 'DataFrame' 'df'
dataCuba = {
    'Provincia': ['Pinar del Río', 'Artemisa', 'La Habana', 'Mayabeque', 'Matanzas', 'Cienfuegos', 'Villa Clara', 'Sancti Spíritus', 'Ciego de Ávila', 'Camagüey', 'Las Tunas', 'Holguín', 'Granma', 'Santiago de Cuba', 'Guantánamo', 'Isla de la Juventud'],
    '2018': [583000, 513000, 2110000, 381000, 716000, 408000, 779000, 462000, 431000, 765000, 536000, 1032000, 838000, 1043000, 511000, 83000],
    '2019': [585000, 515000, 2120000, 383000, 718000, 409000, 780000, 463000, 432000, 766000, 537000, 1033000, 839000, 1044000, 512000, 84000],
    '2020': [587000, 517000, 2130000, 385000, 720000, 410000, 781000, 464000, 433000, 767000, 538000, 1034000, 840000, 1045000, 513000, 85000],
    '2021': [589000, 519000, 2140000, 387000, 722000, 411000, 782000, 465000, 434000, 768000, 539000, 1035000, 841000, 1046000, 514000, 86000],
    '2022': [591000, 521000, 2150000, 389000, 724000, 412000, 783000, 466000, 435000, 769000, 540000, 1036000, 842000, 1047000, 515000, 87000],
    '2023': [593000, 523000, 2160000, 391000, 726000, 413000, 784000, 467000, 436000, 770000, 541000, 1037000, 843000, 1048000, 516000, 88000]
}

df = pd.DataFrame(dataCuba)

print(df)

              Provincia     2018     2019     2020     2021     2022     2023
0         Pinar del Río   583000   585000   587000   589000   591000   593000
1              Artemisa   513000   515000   517000   519000   521000   523000
2             La Habana  2110000  2120000  2130000  2140000  2150000  2160000
3             Mayabeque   381000   383000   385000   387000   389000   391000
4              Matanzas   716000   718000   720000   722000   724000   726000
5            Cienfuegos   408000   409000   410000   411000   412000   413000
6           Villa Clara   779000   780000   781000   782000   783000   784000
7       Sancti Spíritus   462000   463000   464000   465000   466000   467000
8        Ciego de Ávila   431000   432000   433000   434000   435000   436000
9              Camagüey   765000   766000   767000   768000   769000   770000
10            Las Tunas   536000   537000   538000   539000   540000   541000
11              Holguín  1032000  1033000  1034000  1035000  1036000  1037000
12               Granma   838000   839000   840000   841000   842000   843000
13     Santiago de Cuba  1043000  1044000  1045000  1046000  1047000  1048000
14           Guantánamo   511000   512000   513000   514000   515000   516000
15  Isla de la Juventud    83000    84000    85000    86000    87000    88000

In [77]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [95]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [96]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [25]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [6]:
import numpy as np
import pandas as pd

# pop_prov_Cuba es un diccionario donde la clave es un 'string' y el valor es otro diccionario
# La clave externa conforma los encabezamiento de cada fila (columns), es decir las provincias 
# La clave interna conforma lo indices de las filas (index), es decir los 'años' 
# y los valores de la matriz son las poblaciones de las distintas provincias de Cuba

pop_prov_Cuba = {"Pinar del Río": {2018: 583000, 2019: 585000, 2020: 587000, 2021: 589000, 2022: 591000, 2023: 593000}, "Artemisa": {2018: 513000, 2019: 515000, 2020: 517000, 2021: 519000, 2022: 521000, 2023: 523000}, "La Habana": {2018: 2110000, 2019: 2120000, 2020: 2130000, 2021: 2140000,2022: 2150000, 2023: 2160000}, \
"Mayabeque": {2018: 381000, 2019: 383000, 2020: 385000 , 2021: 387000,2022: 389000, 2023: 391000},"Matanzas": {2018: 716000, 2019: 780000, 2020: 781000, 2021: 782000,2022: 783000, 2023: 784000}, "Cienfuegos": {2018: 408000, 2019: 409000, 2020: 410000, 2021: 411000,2022: 412000, 2023: 413000}, \
"Villa Clara": {2018: 779000, 2019: 780000, 2020: 781000, 2021: 782000, 2022: 783000, 2023: 784000}, "Santi Spíritu": {2018: 462000, 2019: 463000, 2020: 464000, 2021: 465000, 2022: 466000, 2023: 467000}, "Ciego de Ávila": {2018: 431000, 2019: 432000, 2020: 433000, 2021: 434000, 2022: 435000, 2023: 436000}, \
"Camaguey": {2018: 765000, 2019: 766000, 2020: 767000, 2021: 768000, 2022: 769000, 2023: 770000}, "Las Tunas": {2018: 536000, 2019: 537000, 2020: 538000, 2021: 539000, 2022: 540000, 2023: 541000}, "Holguín": {2018: 1032000, 2019: 1033000, 2020: 1034000, 2021: 1035000, 2022: 1036000, 2023: 1037000}, \
"Gramma": {2018: 838000, 2019: 839000, 2020: 840000, 2021: 841000, 2022: 842000, 2023: 843000}, "Santiago de Cuba": {2018: 1043000, 2019: 1044000, 2020: 1045000, 2021: 1046000, 2022: 1047000, 2023: 1048000}, "Guantánamo": {2018: 511000, 2019: 512000, 2020: 513000, 2021: 514000, 2022: 515000, 2023: 516000}}  

frame4 = pd.DataFrame(pop_prov_Cuba)

print("POBLACION DE CUBA POR PROVINCIA DESDE LOS AÑOS DE 2018 A 2023")
print("------------------------------------------------------------")
frame4

POBLACION DE CUBA POR PROVINCIA DESDE LOS AÑOS DE 2018 A 2023
------------------------------------------------------------

,Pinar del Río,Artemisa,La Habana,Mayabeque,Matanzas,Cienfuegos,Villa Clara,Santi Spíritu,Ciego de Ávila,Camaguey,Las Tunas,Holguín,Gramma,Santiago de Cuba,Guantánamo
2018,583000,513000,2110000,381000,716000,408000,779000,462000,431000,765000,536000,1032000,838000,1043000,511000
2019,585000,515000,2120000,383000,780000,409000,780000,463000,432000,766000,537000,1033000,839000,1044000,512000
2020,587000,517000,2130000,385000,781000,410000,781000,464000,433000,767000,538000,1034000,840000,1045000,513000
2021,589000,519000,2140000,387000,782000,411000,782000,465000,434000,768000,539000,1035000,841000,1046000,514000
2022,591000,521000,2150000,389000,783000,412000,783000,466000,435000,769000,540000,1036000,842000,1047000,515000
2023,593000,523000,2160000,391000,784000,413000,784000,467000,436000,770000,541000,1037000,843000,1048000,516000

In [7]:
frame4.loc[2021]

Pinar del Río        589000
Artemisa             519000
La Habana           2140000
Mayabeque            387000
Matanzas             782000
Cienfuegos           411000
Villa Clara          782000
Santi Spíritu        465000
Ciego de Ávila       434000
Camaguey             768000
Las Tunas            539000
Holguín             1035000
Gramma               841000
Santiago de Cuba    1046000
Guantánamo           514000
Name: 2021, dtype: int64

In [9]:
frame4.loc[:,"La Habana"]

2018    2110000
2019    2120000
2020    2130000
2021    2140000
2022    2150000
2023    2160000
Name: La Habana, dtype: int64

In [79]:
import pandas as pd


my_dataFrame

    Año   AMD  Intel  Samsung  Seagate
0  2016  4.27  59.39      175    11.16
1  2017  5.33  62.76      215    10.77
2  2018  6.48  70.85      218    11.20
3  2019  6.73  71.97      197    10.51

loc: Se basa en etiquetas (nombres asignados a filas y columnas). Puedes usar etiquetas personalizadas o nombres de índice para acceder a los datos.

Ejemplos:

In [ ]:
df.loc[0] #Selecciona la fila con etiqueta 0.
df.loc['Etiqueta_o_nombre_fila'] #Selecciona la fila con el nombre de la fila o etiqueta.
df.loc[:, 'Nombre_Columna'] #Selecciona una columna por su nombre.

In [2]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

Las columnas pueden modificarse por asignación. Por ejemplo, a la columna debt vacía se le puede asignar un valor escalar o un array de valores:

In [97]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

Cuando asigne listas o arrays a una columna, la longitud del valor debe coincidir con la longitud del DataFrame. Si asigna una Series , sus etiquetas se realinearán exactamente
con el índice del DataFrame, insertando los valores que falten en cualquier valor del índice que no esté presente:

In [98]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [99]:
my_dataFrame["Activo"] = True
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo
0  2016  4.27  59.39      175    11.16    True
1  2017  5.33  62.76      215    10.77    True
2  2018  6.48  70.85      218    11.20    True
3  2019  6.73  71.97      197    10.51    True

In [100]:
val = pd.Series([249.82, 293.86, 306.53, 286.21], index=[0, 1, 2, 3])
my_dataFrame["Ventas_totales"] = val
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo  Ventas_totales
0  2016  4.27  59.39      175    11.16    True          249.82
1  2017  5.33  62.76      215    10.77    True          293.86
2  2018  6.48  70.85      218    11.20    True          306.53
3  2019  6.73  71.97      197    10.51    True          286.21

Al asignar una columna que no existe se creará una columna nueva. La palabra clave 'del' borrará columnas como con un diccionario. Como ejemplo, primero se añade una nueva
columna de valores booleanos donde la columna state es igual a "Ohio" :

In [5]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [101]:
my_dataFrame["Mayor_300"] = my_dataFrame["Ventas_totales"] > 300
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo  Ventas_totales  Mayor_300
0  2016  4.27  59.39      175    11.16    True          249.82      False
1  2017  5.33  62.76      215    10.77    True          293.86      False
2  2018  6.48  70.85      218    11.20    True          306.53       True
3  2019  6.73  71.97      197    10.51    True          286.21      False

El método 'del' se puede utilizar para eliminar esta columna:

In [6]:
del frame2["eastern"]

In [ ]:
del my_dataFrame["Mayor_300"]

In [106]:
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo  Ventas_totales
0  2016  4.27  59.39      175    11.16    True          249.82
1  2017  5.33  62.76      215    10.77    True          293.86
2  2018  6.48  70.85      218    11.20    True          306.53
3  2019  6.73  71.97      197    10.51    True          286.21

In [7]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [104]:
my_dataFrame.columns

Index(['Año', 'AMD', 'Intel', 'Samsung', 'Seagate', 'Activo',
       'Ventas_totales'],
      dtype='object')

In [8]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [9]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Otra forma común de datos es un diccionario anidado de diccionarios:

In [10]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

Si el diccionario anidado se pasa al DataFrame, pandas interpretará las claves externas del diccionario como las columnas, y las claves internas como los índices de fila:

In [27]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [12]:
import numpy as np
import pandas as pd

pop_prov_Cuba = {"Pinar del Río": {2018: 583000, 2019: 585000, 2020: 587000, 2021: 589000, 2022: 591000, 2023: 593000}, "Artemisa": {2018: 513000, 2019: 515000, 2020: 517000, 2021: 519000, 2022: 521000, 2023: 523000}, "La Habana": {2018: 2110000, 2019: 2120000, 2020: 2130000, 2021: 2140000,2022: 2150000, 2023: 2160000}, \
"Mayabeque": {2018: 381000, 2019: 383000, 2020: 385000 , 2021: 387000,2022: 389000, 2023: 391000},"Matanzas": {2018: 716000, 2019: 780000, 2020: 781000, 2021: 782000,2022: 783000, 2023: 784000}, "Cienfuegos": {2018: 408000, 2019: 409000, 2020: 410000, 2021: 411000,2022: 412000, 2023: 413000}, \
"Villa Clara": {2018: 779000, 2019: 780000, 2020: 781000, 2021: 782000, 2022: 783000, 2023: 784000}, "Santi Spíritu": {2018: 462000, 2019: 463000, 2020: 464000, 2021: 465000, 2022: 466000, 2023: 467000}, "Ciego de Ávila": {2018: 431000, 2019: 432000, 2020: 433000, 2021: 434000, 2022: 435000, 2023: 436000}, \
"Camaguey": {2018: 765000, 2019: 766000, 2020: 767000, 2021: 768000, 2022: 769000, 2023: 770000}, "Las Tunas": {2018: 536000, 2019: 537000, 2020: 538000, 2021: 539000, 2022: 540000, 2023: 541000}, "Holguín": {2018: 1032000, 2019: 1033000, 2020: 1034000, 2021: 1035000, 2022: 1036000, 2023: 1037000}, \
"Gramma": {2018: 838000, 2019: 839000, 2020: 840000, 2021: 841000, 2022: 842000, 2023: 843000}, "Santiago de Cuba": {2018: 1043000, 2019: 1044000, 2020: 1045000, 2021: 1046000, 2022: 1047000, 2023: 1048000}, "Guantánamo": {2018: 511000, 2019: 512000, 2020: 513000, 2021: 514000, 2022: 515000, 2023: 516000}}  

frame5 = pd.DataFrame(pop_prov_Cuba)
frame5

,Pinar del Río,Artemisa,La Habana,Mayabeque,Matanzas,Cienfuegos,Villa Clara,Santi Spíritu,Ciego de Ávila,Camaguey,Las Tunas,Holguín,Gramma,Santiago de Cuba,Guantánamo
2018,583000,513000,2110000,381000,716000,408000,779000,462000,431000,765000,536000,1032000,838000,1043000,511000
2019,585000,515000,2120000,383000,780000,409000,780000,463000,432000,766000,537000,1033000,839000,1044000,512000
2020,587000,517000,2130000,385000,781000,410000,781000,464000,433000,767000,538000,1034000,840000,1045000,513000
2021,589000,519000,2140000,387000,782000,411000,782000,465000,434000,768000,539000,1035000,841000,1046000,514000
2022,591000,521000,2150000,389000,783000,412000,783000,466000,435000,769000,540000,1036000,842000,1047000,515000
2023,593000,523000,2160000,391000,784000,413000,784000,467000,436000,770000,541000,1037000,843000,1048000,516000

Puede transponer el DataFrame (intercambiar filas y columnas) con una sintaxis similar a la de un array NumPy:

In [12]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [13]:
frame5.T

                     2018     2019     2020     2021     2022     2023
Pinar del Río      583000   585000   587000   589000   591000   593000
Artemisa           513000   515000   517000   519000   521000   523000
La Habana         2110000  2120000  2130000  2140000  2150000  2160000
Mayabeque          381000   383000   385000   387000   389000   391000
Matanzas           716000   780000   781000   782000   783000   784000
Cienfuegos         408000   409000   410000   411000   412000   413000
Villa Clara        779000   780000   781000   782000   783000   784000
Santi Spíritu      462000   463000   464000   465000   466000   467000
Ciego de Ávila     431000   432000   433000   434000   435000   436000
Camaguey           765000   766000   767000   768000   769000   770000
Las Tunas          536000   537000   538000   539000   540000   541000
Holguín           1032000  1033000  1034000  1035000  1036000  1037000
Gramma             838000   839000   840000   841000   842000   843000
Santiago de Cuba  1043000  1044000  1045000  1046000  1047000  1048000
Guantánamo         511000   512000   513000   514000   515000   516000

In [13]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

Las claves de los diccionarios internos se combinan para formar el índice del resultado. Esto no es cierto si se especifica un índice explícito:

In [14]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

Los diccionarios de Series reciben un tratamiento muy similar

In [17]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [15]:
pdata = {"Ohio": frame3["Ohio"][:-1],"Nevada": frame3["Nevada"][:2]}
# frame3["Ohio"][:-1]: Extrae todos los valores de la columna “Ohio”
# excepto el último valor.
# frame3["Nevada"][:2]:Extrae los primeros dos valores de la columna “Nevada”
# en el DataFrame frame3.
print(pdata)

{'Ohio': 2000    1.5
2001    1.7
Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
2001    2.4
Name: Nevada, dtype: float64}

In [30]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

Posibles entradas de datos para el constructor DataFrame

Si el índice y las columnas de un DataFrame tienen definidos atributos de nombre, éstos también se mostrarán:

In [31]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [24]:
frame5

,Pinar del Río,Artemisa,La Habana,Mayabeque,Matanzas,Cienfuegos,Villa Clara,Santi Spíritu,Ciego de Ávila,Camaguey,Las Tunas,Holguín,Gramma,Santiago de Cuba,Guantánamo
2018,583000,513000,2110000,381000,716000,408000,779000,462000,431000,765000,536000,1032000,838000,1043000,511000
2019,585000,515000,2120000,383000,780000,409000,780000,463000,432000,766000,537000,1033000,839000,1044000,512000
2020,587000,517000,2130000,385000,781000,410000,781000,464000,433000,767000,538000,1034000,840000,1045000,513000
2021,589000,519000,2140000,387000,782000,411000,782000,465000,434000,768000,539000,1035000,841000,1046000,514000
2022,591000,521000,2150000,389000,783000,412000,783000,466000,435000,769000,540000,1036000,842000,1047000,515000
2023,593000,523000,2160000,391000,784000,413000,784000,467000,436000,770000,541000,1037000,843000,1048000,516000

In [32]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

A diferencia de Series , DataFrame no tiene atributo name. El método to_numpy de DataFrame devuelve los datos contenidos en el DataFrame como un ndarray bidimensional:

In [33]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

Si las columnas del DataFrame son de diferentes tipos de datos, el tipo de datos del array devuelto se elegirá para acomodar todas las columnas, veamos lo que contiene frame2:

In [23]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [24]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

OBJETOS INDICES

Los objetos Index de pandas son responsables de mantener las etiquetas de los ejes (incluyendo los nombres de las columnas de un DataFrame) y otros metadatos (como el
nombre o nombres de los ejes). Cualquier array u otra secuencia de etiquetas que se utilice al construir una Series o DataFrame se convierte internamente en un Índice:

In [34]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int64

In [35]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [37]:
index[1:]

Index(['b', 'c'], dtype='object')

Los objetos índice son inmutables y, por tanto, no pueden ser modificados por el usuario:

In [38]:
index[1] = "d" # TypeError

TypeError: Index does not support mutable operations

La inmutabilidad hace que sea más seguro compartir objetos índice entre estructuras de datos:

In [39]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [40]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [41]:
obj2.index is labels

True

Además de ser similar a un array, un índice también se comporta como un conjunto (set) de tamaño fijo:

In [42]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [43]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [25]:
frame4.columns

Index(['Pinar del Río', 'Artemisa', 'La Habana', 'Mayabeque', 'Matanzas',
       'Cienfuegos', 'Villa Clara', 'Santi Spíritu', 'Ciego de Ávila',
       'Camaguey', 'Las Tunas', 'Holguín', 'Gramma', 'Santiago de Cuba',
       'Guantánamo'],
      dtype='object')

In [26]:
frame5.index

Index([2018, 2019, 2020, 2021, 2022, 2023], dtype='int64')

In [44]:
"Ohio" in frame3.columns

True

In [45]:
2003 in frame3.index

False

In [27]:
2024 in frame5.index

False

In [28]:
2023 in frame5.index

True

A diferencia de los conjuntos ( set() ) de Python, un índice de pandas puede contener etiquetas duplicadas

In [46]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Las selecciones con etiquetas duplicadas tomarán todas las apariciones de esa etiqueta. Cada Índice tiene una serie de métodos y propiedades para la lógica de conjuntos, que
responden a otras preguntas habituales sobre los datos que contiene. Algunas de las más útiles se resumen en:

FUNCIONES ESENCIALES

Esta sección es una guia a través de la mecánica fundamental de la interacción con los datos contenidos en una Serie o DataFrame.

Reindexación (Reindexing)

Un método importante en los objetos pandas es reindex , que significa crear un nuevo objeto con los valores reordenados para alinearlos con el nuevo índice. Consideremos un
ejemplo:

In [30]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

objeto_1 = pd.Series([1.0, 8.3, -8.2], index=["z","j","p"])

In [31]:
import pandas as pd
objeto_1

z    1.0
j    8.3
p   -8.2
dtype: float64

In [35]:
import pandas as pd
objeto_2 = objeto_1.reindex(["z","j","p","A"])

Si se llama a reindex en esta Series , los datos se reordenan de acuerdo con el nuevo índice, introduciendo los valores que faltan si alguno de los valores del índice no estaba ya
presente:

In [48]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

En el caso de datos ordenados como series temporales, es posible que desee realizar alguna interpolación o relleno de valores al reindexar. Utilizando un método como ffill , que
rellena los valores hacia delante

In [42]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [44]:
import numpy as np
import pandas as pd

obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [50]:
import numpy as np
import pandas as pd

objeto_1 = pd.Series([1.0, 8.3, -8.2], index=["z","j","p"])
objeto_2 = pd.Series([1.0, 8.3, -8.2, np.nan, np.nan, np.nan], index=[0, 1, 2, 3, 4, 5])

print(objeto_2)

objeto_2_reindexed = objeto_2.reindex(np.arange(6), method="ffill")

print(objeto_2_reindexed)

0    1.0
1    8.3
2   -8.2
3    NaN
4    NaN
5    NaN
dtype: float64
0    1.0
1    8.3
2   -8.2
3    NaN
4    NaN
5    NaN
dtype: float64

Con DataFrame, reindex puede alterar el índice (de filas), las columnas o ambos. Si sólo se le pasa una secuencia, reindexa las filas del resultado:

In [55]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"]) 
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [56]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [57]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [58]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [53]:
import numpy as np
import pandas as pd

provincias=["La Habana", "Holguin", "Ciego de Ávila"]
frame4.reindex(columns=provincias)

      La Habana  Holguin  Ciego de Ávila
2018    2110000      NaN          431000
2019    2120000      NaN          432000
2020    2130000      NaN          433000
2021    2140000      NaN          434000
2022    2150000      NaN          435000
2023    2160000      NaN          436000

Como "Ohio" no estaba en los states , los datos de esa columna se eliminan del resultado. Otra forma de hacer reindex en un eje concreto es pasar las nuevas etiquetas de eje como argumento posicional y, a continuación, especificar el eje que se va a reindexar con la palabra clave axis :

In [59]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

En un DataFrame tambien se puede usar loc e iloc , para reindexar, y muchos usuarios prefieren hacerlo siempre de esta manera. Esto sólo funciona si todas las nuevas etiquetas
de índice ya existen en el DataFrame (mientras que reindex insertará los datos que falten para las nuevas etiquetas):

In [60]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [61]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [56]:
import numpy as np
import pandas as pd

frame4.loc[[2018, 2018], ["La Habana"]]

      La Habana
2018    2110000
2018    2110000

Eliminar entradas de un eje

Eliminar una o más entradas de un eje es sencillo si ya tienes un array o una lista de índices sin esas entradas, ya que puedes utilizar el método reindex o la indexación basada en
.loc . Como eso puede requerir un poco de lógica el método drop devolverá un nuevo objeto con el valor o valores indicados eliminados de un eje:

In [62]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [60]:
import numpy as np
import pandas as pd

objeto_3 = pd.Series(np.arange(5), index=["A", "B", "C", "D", "E"])
print(objeto_3)

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [63]:
nuevo_objeto_3= objeto_3.drop("E")
nuevo_objeto_3

A    0
B    1
C    2
D    3
dtype: int64

In [61]:
#alvknasñdlvkas´dovl

new_obj = obj.drop("c")
new_obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [64]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

Con DataFrame, los valores índice se pueden eliminar de cualquiera de los ejes. Para ilustrar esto, primero crearemos un DataFrame de ejemplo:

In [65]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
import numpy as np
import pandas as pd

Mi_dato = pd.DataFrame(np.arange(25).reshape((5, 5)),
index=["Pinar del Rio", "Artemisa", "La Habana", "Mayabeque", "Matanzas"],
columns=["2018", "2019", "2020", "2021", "2022"])
Mi_dato

               2018  2019  2020  2021  2022
Pinar del Rio     0     1     2     3     4
Artemisa          5     6     7     8     9
La Habana        10    11    12    13    14
Mayabeque        15    16    17    18    19
Matanzas         20    21    22    23    24

In [75]:
import numpy as np
import pandas as pd


random_data = np.random.randint(0, 100, size=(5, 5))

Mi_dato = pd.DataFrame(random_data,
                       index=["Pinar del Rio", "Artemisa", "La Habana", "Mayabeque", "Matanzas"],
                       columns=["2018", "2019", "2020", "2021", "2022"])
Mi_dato

               2018  2019  2020  2021  2022
Pinar del Rio    69    88    43    71    30
Artemisa         57    23    21    59    22
La Habana        91    14    18    66    75
Mayabeque        19    57    89    53    47
Matanzas         30    89    68    52    91

Si se llama a drop con una secuencia de etiquetas, se eliminarán los valores de las etiquetas de fila (eje 0):

In [66]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [76]:
Mi_dato.drop(index=["Mayabeque", "Matanzas"])

               2018  2019  2020  2021  2022
Pinar del Rio    69    88    43    71    30
Artemisa         57    23    21    59    22
La Habana        91    14    18    66    75

Para eliminar las etiquetas de las columnas, utilice en su lugar la palabra clave columns:

In [67]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [78]:
Mi_dato.drop(columns=["2022"])

               2018  2019  2020  2021
Pinar del Rio    69    88    43    71
Artemisa         57    23    21    59
La Habana        91    14    18    66
Mayabeque        19    57    89    53
Matanzas         30    89    68    52

También puede eliminar valores de las columnas pasando axis=1 ( como en NumPy) o axis="columns":

In [68]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [82]:
import numpy as np
import pandas as pd

Mi_dato.drop("2019", axis=1)

# axis = 0 se refiere a las filas
# axis = 1 se refiere a las columnas

               2018  2020  2021  2022
Pinar del Rio    69    43    71    30
Artemisa         57    21    59    22
La Habana        91    18    66    75
Mayabeque        19    89    53    47
Matanzas         30    68    52    91

In [69]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [83]:
Mi_dato.drop(["2021", "2022"], axis="columns")

               2018  2019  2020
Pinar del Rio    69    88    43
Artemisa         57    23    21
La Habana        91    14    18
Mayabeque        19    57    89
Matanzas         30    89    68

Indexación, selección y filtrado

La indexación de series ( obj[...] ) funciona de forma análoga a la indexación de arrays de NumPy, con la diferencia de que puedes utilizar los valores índice de la serie en lugar de sólo
enteros. He aquí algunos ejemplos:

In [100]:
obj = pd.Series(np.arange(4), index=["a", "b", "c", "d"])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [102]:
objeto_6=pd.Series(np.arange(6.), index=["1","2","3","4","6","7"])
objeto_6

1    0.0
2    1.0
3    2.0
4    3.0
6    4.0
7    5.0
dtype: float64

In [104]:
obj["a"]

np.int64(0)

In [106]:
objeto_6["2"]

np.float64(1.0)

In [ ]:
obj["b"]

In [ ]:
obj[2:4]

In [107]:
obj[["b", "a", "d"]]

b    1
a    0
d    3
dtype: int64

In [108]:
objeto_6[["1","2","3"]]

1    0.0
2    1.0
3    2.0
dtype: float64

In [116]:
import numpy as np
import pandas as pd

obj = pd.Series(np.arange(4), index=["a", "b", "c", "d"])
obj[["a", "b"]]

a    0
b    1
dtype: int64

In [92]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Aunque puede seleccionar datos por etiqueta de esta manera, la forma preferida de seleccionar valores de índice es con el operador especial loc :

In [117]:
obj.loc[["b", "a", "d"]]

b    1
a    0
d    3
dtype: int64

In [118]:
objeto_6.loc[["2", "3", "4"]]

2    1.0
3    2.0
4    3.0
dtype: float64

La razón para preferir loc es el tratamiento diferente de los enteros cuando se indexa con [] . La indexación normal basada en [] tratará los enteros como etiquetas si el índice
contiene enteros, por lo que el comportamiento difiere dependiendo del tipo de datos del índice. Por ejemplo:

In [ ]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [2]:
import pandas as pd
objeto_7 = pd.Series([15, 2000, 30], index=[0, 1, 2])
objeto_8 = pd.Series([1000, 20000, 30000], index=["A", "B", "C"])


objeto_8

A     1000
B    20000
C    30000
dtype: int64

In [ ]:
obj1

In [ ]:
obj2

In [ ]:
obj1[[0, 1, 2]]

Al utilizar loc , la expresión obj.loc[[0, 1, 2]] fallará cuando el índice no contenga enteros:

In [ ]:
obj2.loc[[0, 1]]

Dado que el operador loc indexa exclusivamente con etiquetas, existe también un operador iloc que indexa exclusivamente con enteros para trabajar de forma consistente
tanto si el índice contiene enteros como si no:

In [ ]:
obj1.iloc[[0, 1, 2]]

In [ ]:
obj2.iloc[[0, 1, 2]]

Precaución: También se puede rebanar (slice) con etiquetas, pero funciona de forma diferente al rebanado(slicing) normal de Python, ya que el punto final es inclusivo:

In [ ]:
obj2.loc["b":"c"]

La asignación de valores mediante estos métodos modifica la sección correspondiente de la Series:

In [ ]:
obj2

In [ ]:
obj2.loc["b":"c"] = 5
obj2

La indexación en un DataFrame recupera una o más columnas, ya sea con un único valor o con una secuencia:

In [77]:

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])

data1 = pd.DataFrame([[23,45],[56,45]],
 index=["Ohio", "Colorado"],
 columns=["one", "two"])

print(data)
print()
print(data1)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two
Ohio       23   45
Colorado   56   45

In [65]:
print(data.loc[:,["three"]])

          three
Ohio          2
Colorado      6
Utah         10
New York     14

In [67]:
data.loc[:,["three", "four"]]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [71]:
data.loc[["Ohio", "Utah"]]

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

Este tipo de indexación tiene algunos casos especiales. El primero es el corte (slicing) o la selección de datos con una array booleano:

In [78]:
import numpy as np
import pandas as pd

data[:2]
# selecciona las primeras dos filas del DataFrame.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [88]:
import numpy as np
import pandas as pd

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])

data[data["three"] > 6]  #Busca los elementos de la columna 'three' imprime los que sean mayor de 6

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

La sintaxis de selección de filas data[:2] se proporciona por comodidad. Si se pasa un único elemento o una lista al operador [] selecciona columnas.
Otro caso de uso es la indexación con un DataFrame booleano, como el producido por una comparación escalar. Considere un DataFrame con todos los valores booleanos producidos
por comparación con un valor escalar:

In [87]:
import numpy as np
import pandas as pd 

data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

Podemos utilizar este DataFrame para asignar el valor 0 a cada ubicación con el valor True, así:

In [97]:
import numpy as np
import pandas as pd

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

data[data < 5] = 0 #Pone cero en los elementps del DataFrame que cumplan con la condición

print(data)

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Selección en un DataFrame con loc e iloc

Al igual que Series , los DataFrame tiene atributos especiales loc e iloc para la indexación basada en etiquetas y en enteros, respectivamente. Como un DataFrame es
bidimensional, puede seleccionar un subconjunto de filas y columnas con notación tipo NumPy utilizando etiquetas de eje (loc) o enteros (iloc).

Como primer ejemplo, vamos a seleccionar una sola fila por etiqueta:

In [52]:
import numpy as np
import pandas as pd

data



df=pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [32]:
df1=pd.DataFrame(data)
df.loc[1]
df.loc[:, ["pop"]]
df1.loc[0]
print(df.loc[:, ["pop"]])
print()
print(df1.loc[0])

   pop
0  1.5
1  1.7
2  3.6
3  2.4
4  2.9
5  3.2

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

El resultado de seleccionar una sola fila es una Series con un índice que contiene las etiquetas de las columnas del DataFrame . Para seleccionar múltiples valores, creando un
nuevo DataFrame, se le pasa una secuencia de etiquetas:

In [51]:
import pandas as pd
import numpy as np

#print(df.loc[:, ["pop"]])
print(df.loc[3])

state    Nevada
year       2001
pop         2.4
Name: 3, dtype: object

Puede combinar la selección de filas y columnas en loc separando las selecciones con una coma:

In [98]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

A continuación, realizaremos algunas selecciones similares con enteros utilizando iloc:

In [99]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [100]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [ ]:
data.iloc[2, [3, 0, 1]]

In [ ]:
data.iloc[[1, 2], [3, 0, 1]]

Ambas funciones de indexación funcionan con trozos (slices) además de con etiquetas individuales o listas de etiquetas:

In [ ]:
data

In [101]:
data.loc[:"Utah", "two"]
# Devuelve los valores de la columna "two" 
# para todas las filas desde el inicio 
# hasta la fila con la etiqueta "Utah"

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [102]:
data.iloc[:, :3][data.three > 5]
# Muestra las filas que cumplen
# la condición data.three > 5 
# para las columnas 'one', 'two'
# y 'three'
# Para mayor claridad ejecute 
# data.iloc[:, :3] y luego
# data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

Los arrays Booleanos pueden ser usados con loc pero no iloc:
Considere lo siguiente:

In [103]:
data.three >= 2

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [104]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Hay muchas formas de seleccionar y reordenar los datos contenidos en un objeto pandas. Para un DataFrame , la siguiente tabla proporciona un breve resumen de muchas de ellas.
Como se verá más adelante, hay una serie de opciones adicionales para trabajar con índices jerárquicos.

Errores en la indexación de números enteros

Trabajar con objetos pandas indexados por enteros puede ser un escollo para los nuevos usuarios ya que funcionan de forma diferente a las estructuras de datos incorporadas en
Python como listas y tuplas. Por ejemplo, es posible que no espere que el siguiente código genere un error

In [105]:
ser = pd.Series(np.arange(3.))

In [108]:
ser.iloc[-1]

np.float64(2.0)

En este caso, pandas podría "recurrir" a la indexación por enteros, pero es difícil hacer esto en general sin introducir errores sutiles en el código de usuario. Aquí tenemos un índice que
contiene 0, 1 y 2, pero pandas no quiere adivinar lo que quiere el usuario (indexación basada en etiquetas o basada en posiciones):

In [109]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

En cambio, con un índice no entero, no existe tal ambigüedad:

In [111]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2.iloc[-2]

np.float64(1.0)

Si tienes un índice de eje que contiene enteros, la selección de datos siempre estará orientada a etiquetas. Como se ha dicho anteriormente, si se utiliza loc (para etiquetas) o
iloc (para enteros) se obtendrá exactamente lo que se desea:

In [112]:
ser.iloc[-1]

np.float64(2.0)

Por otra parte, el corte (slicing) con números enteros siempre está orientado a números enteros:

In [113]:
ser[:2]

0    0.0
1    1.0
dtype: float64

Como consecuencia de estos errores, es mejor preferir siempre la indexación con loc e iloc para evitar ambigüedades.

Errores de la indexación encadenada
En la sección anterior vimos cómo se pueden hacer selecciones flexibles en un DataFrame utilizando loc e iloc . Estos atributos de indexación también se pueden utilizar para
modificar objetos DataFrame "in situ", pero hacerlo requiere cierto cuidado. Por ejemplo, en el ejemplo DataFrame anterior, podemos asignar a una columna o fila por
etiqueta o posición entera:

In [114]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [116]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [117]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

Un error común para los nuevos usuarios de pandas es encadenar selecciones cuando se asignan de esta manera:

In [118]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [119]:
data.loc[data.three == 5]
# La condición data.three == 5 
# crea una Serie booleana que 
# tiene True para las filas 
# donde el valor en la columna "three" 
# es igual a 5 y False para las demás filas.

      one  two  three  four
Utah    5    5      5     5

In [ ]:
data.loc[data.three == 5]["three"] = 6

Dependiendo del contenido de los datos, esto puede imprimir una advertencia especial SettingWithCopyWarning , que le advierte de que está intentando modificar un valor
temporal (el resultado no vacío de data.loc[data.three == 5]) en lugar del DataFrame original data , que podría ser lo que pretendía. En este caso, data no se ha
modificado:

In [120]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

En estos casos, la solución consiste en reescribir la asignación encadenada para utilizar una única operación loc:

In [121]:
data.loc[data.three == 5, "three"] = 6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3